pwbf/RX64M_ETHERNET/r_usb_basic/src/driver/comm/r_usb_clibusbip.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014(2015) Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_usb_clibusbip.c
* Description  : USB IP Host and Peripheral low level library
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 04.01.2014 1.00 First Release
*         : 30.01.2015 1.01    Added RX71M.
***********************************************************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include "r_usb_basic_if.h"
#include "r_usb_reg_access.h"


/******************************************************************************
Constant macro definitions
******************************************************************************/


/******************************************************************************
External variables and functions
******************************************************************************/


/******************************************************************************
Private global variables and functions
******************************************************************************/

/******************************************************************************
Renesas Abstracted Driver API functions
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_NrdyEnable
Description     : Enable NRDY interrupt of the specified pipe.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : none
******************************************************************************/
void usb_cstd_NrdyEnable(USB_UTR_t *ptr, uint16_t pipe)
{
    /* Check current function */
    if( usb_cstd_is_host_mode(ptr) == USB_NO )
    {
        /*  At the peripheral operation, interrupt is disabled, */
        /*  because handler becomes busy. */
    }
    else
    {
        /* Enable NRDY */
        usb_creg_set_nrdyenb( ptr, pipe );
    }
}
/******************************************************************************
End of function usb_cstd_NrdyEnable
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_BerneEnable
Description     : Enable BRDY/NRDY/BEMP interrupt.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
Return value    : none
******************************************************************************/
void usb_cstd_BerneEnable(USB_UTR_t *ptr)
{
    /* Enable BEMP, NRDY, BRDY */
    usb_creg_set_intenb( ptr, (USB_BEMPE|USB_NRDYE|USB_BRDYE) );
}
/******************************************************************************
End of function usb_cstd_BerneEnable
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_SwReset
Description     : Request USB IP software reset
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
Return value    : none
******************************************************************************/
void usb_cstd_SwReset(USB_UTR_t *ptr)
{
    /* USB Enable */
    usb_creg_set_usbe( ptr );
    /* USB Reset */
    usb_creg_clr_usbe( ptr );
    /* USB Enable */
    usb_creg_set_usbe( ptr );
}
/******************************************************************************
End of function usb_cstd_SwReset
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_GetPid
Description     : Fetch specified pipe's PID.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : uint16_t PID-bit status
******************************************************************************/
uint16_t usb_cstd_GetPid(USB_UTR_t *ptr, uint16_t pipe)
{
    uint16_t    buf;

    /* PIPE control reg read */
    buf = usb_creg_read_pipectr( ptr, pipe );
    return (uint16_t)(buf & USB_PID);
}
/******************************************************************************
End of function usb_cstd_GetPid
******************************************************************************/

