pwbf/RX64M_ETHERNET/r_usb_basic/src/driver/comm/r_usb_clibusbip.c
/******************************************************************************
Function Name   : usb_cstd_DoSqtgl
Description     : Toggle setting of the toggle-bit for the specified pipe by 
                : argument.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe     : Pipe number.
                : uint16_t toggle   : Current toggle status.
Return value    : none
******************************************************************************/
void usb_cstd_DoSqtgl(USB_UTR_t *ptr, uint16_t pipe, uint16_t toggle)
{
    /* Check toggle */
    if( (toggle & USB_SQMON) == USB_SQMON )
    {
        /* Do pipe SQSET */
        usb_creg_set_sqset(ptr, pipe);
    }
    else
    {
        /* Do pipe SQCLR */
        usb_creg_set_sqclr(ptr, pipe);
    }
}
/******************************************************************************
End of function usb_cstd_DoSqtgl
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_GetMaxPacketSize
Description     : Fetch MaxPacketSize of the specified pipe.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : uint16_t MaxPacketSize
******************************************************************************/
uint16_t usb_cstd_GetMaxPacketSize(USB_UTR_t *ptr, uint16_t pipe)
{
    uint16_t    size, buffer;

    if( pipe == USB_PIPE0 )
    {
        buffer = usb_creg_read_dcpmaxp( ptr );
    }
    else
    {
        /* Pipe select */
        usb_creg_write_pipesel( ptr, pipe );
        buffer = usb_creg_read_pipemaxp( ptr );
    }
    /* Max Packet Size */
    size = (uint16_t)(buffer & USB_MXPS);

    return size;
}
/******************************************************************************
End of function usb_cstd_GetMaxPacketSize
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_GetDevsel
Description     : Get device address from pipe number
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : uint16_t DEVSEL-bit status
******************************************************************************/
uint16_t usb_cstd_GetDevsel(USB_UTR_t *ptr, uint16_t pipe)
{
    uint16_t    devsel, buffer;

    /* Check current function */
    if( usb_cstd_is_host_mode(ptr) == USB_NO )
    {
#if USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP
        /* Peripheral Function */
        /* USB address */
        buffer = usb_creg_read_usbaddr( ptr );
        /* Device address */
        devsel = (uint16_t)(buffer & USB_USBADDR_MASK);
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP */
    }
    else
    {
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
        if( pipe == USB_PIPE0 )
        {
            buffer = usb_creg_read_dcpmaxp( ptr );
        }
        else
        {
            /* Pipe select */
            usb_creg_write_pipesel( ptr, pipe );
            buffer = usb_creg_read_pipemaxp( ptr );
        }
        /* Device address */
        devsel = (uint16_t)(buffer & USB_DEVSEL);
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
    }

    return devsel;
}
/******************************************************************************
End of function usb_cstd_GetDevsel
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_GetPipeDir
Description     : Get PIPE DIR
Arguments       : uint16_t pipe  : Pipe number.
Return value    : uint16_t Pipe direction.
******************************************************************************/
uint16_t usb_cstd_GetPipeDir(USB_UTR_t *ptr, uint16_t pipe)
{
    uint16_t        buffer;

    /* Pipe select */
    usb_creg_write_pipesel( ptr, pipe );
    /* Read Pipe direction */
    buffer = usb_creg_read_pipecfg( ptr );
    return (uint16_t)(buffer & USB_DIRFIELD);
}
/******************************************************************************
End of function usb_cstd_GetPipeDir
******************************************************************************/


/******************************************************************************
Function Name   : usb_cstd_GetPipeType
Description     : Fetch and return PIPE TYPE.
Arguments       : uint16_t pipe            : Pipe number.
Return value    : uint16_t Pipe type
******************************************************************************/
uint16_t usb_cstd_GetPipeType(USB_UTR_t *ptr, uint16_t pipe)
{
    uint16_t        buffer;

    /* Pipe select */
    usb_creg_write_pipesel( ptr, pipe );
    /* Read Pipe direction */
    buffer = usb_creg_read_pipecfg( ptr );
    return (uint16_t)(buffer & USB_TYPFIELD);
}
/******************************************************************************
End of function usb_cstd_GetPipeType
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_is_host_mode
Description     : Check current function
Arguments       : none
Return value    : uint16_t    : YES = Host
                :             : NO = Peripheral
******************************************************************************/
uint16_t usb_cstd_is_host_mode(USB_UTR_t *ptr)
{
    uint16_t    buf;
    buf = usb_creg_read_syscfg( ptr, USB_PORT0 );
    if( (buf & USB_DCFM) == USB_DCFM )
    {
        /* Host Function mode */
        return USB_YES;
    }
    else
    {
        /* Peripheral Function mode */
        return USB_NO;
    }
}
/******************************************************************************
End of function usb_cstd_is_host_mode
******************************************************************************/

