pwbf/RX64M_ETHERNET/r_usb_basic/src/driver/comm/r_usb_clibusbip.c
/******************************************************************************
Function Name   : usb_cstd_DoAclrm
Description     : Set the ACLRM-bit (Auto Buffer Clear Mode) of the specified 
                : pipe.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : none
******************************************************************************/
void usb_cstd_DoAclrm(USB_UTR_t *ptr, uint16_t pipe)
{
    /* Control ACLRM */
    usb_creg_set_aclrm( ptr, pipe );
    usb_creg_clr_aclrm( ptr, pipe );
}
/******************************************************************************
End of function usb_cstd_DoAclrm
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_SetBuf
Description     : Set PID (packet ID) of the specified pipe to BUF.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : none
******************************************************************************/
void usb_cstd_SetBuf(USB_UTR_t *ptr, uint16_t pipe)
{
    /* PIPE control reg set */
    usb_creg_set_pid( ptr, pipe, USB_PID_BUF );
}
/******************************************************************************
End of function usb_cstd_SetBuf
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_ClrStall
Description     : Set up to NAK the specified pipe, and clear the STALL-bit set
                : to the PID of the specified pipe.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : none
Note            : PID is set to NAK.
******************************************************************************/
void usb_cstd_ClrStall(USB_UTR_t *ptr, uint16_t pipe)
{
    /* Set NAK */
    usb_cstd_SetNak(ptr, pipe);
    /* Clear STALL */
    usb_creg_clr_pid( ptr, pipe, USB_PID_STALL );
}
/******************************************************************************
End of function usb_cstd_ClrStall
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_Epadr2Pipe
Description     : Get the associated pipe no. of the specified endpoint.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t dir_ep : Direction + endpoint number.
Return value    : uint16_t        : OK    : Pipe number.
                :                 : ERROR : Error.
******************************************************************************/
uint16_t usb_cstd_Epadr2Pipe(USB_UTR_t *ptr, uint16_t dir_ep)
{
    uint16_t        i, direp, tmp, *table;

    /* Check current function */
    if( usb_cstd_is_host_mode(ptr) == USB_NO )
    {
#if USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP
        uint16_t conf;

        conf = usb_gpstd_ConfigNum;
        if( conf < (uint16_t)1 )
        {
            /* Address state */
            conf = (uint16_t)1;
        }

        /* Peripheral */
        /* Get PIPE Number from Endpoint address */
        table = (uint16_t*)((uint16_t**)(usb_gpstd_Driver.pipetbl[conf - 1]));
        direp = (uint16_t)(((dir_ep & 0x80) >> 3) | (dir_ep & 0x0F));
        /* EP table loop */
        for( i = 0; table[i] != USB_PDTBLEND; i += USB_EPL )
        {
            tmp = (uint16_t)(table[i + 1] & (USB_DIRFIELD | USB_EPNUMFIELD));
            /* EP table endpoint dir check */
            if( direp == tmp )
            {
                return table[i];
            }
        }
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP */
    }
    else
    {
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
        uint16_t        md;
        USB_HCDREG_t    *driver;

        /* Host */
        /* Get PIPE Number from Endpoint address */
        for( md = 0; md < usb_ghstd_DeviceNum[ptr->ip]; md++ )
        {
            if( (usb_ghstd_DeviceDrv[ptr->ip][md].ifclass != USB_IFCLS_NOT) &&
                (usb_ghstd_DeviceDrv[ptr->ip][md].devaddr != USB_NODEVICE) )
            {
                driver = (USB_HCDREG_t*)&usb_ghstd_DeviceDrv[ptr->ip][md];
                table = (uint16_t*)(driver->pipetbl);
                direp = (uint16_t)((((dir_ep & 0x80) ^ 0x80) >> 3) | (dir_ep & 0x0F));
                /* EP table loop */
                for( i = 0; table[i] != USB_PDTBLEND; i += USB_EPL )
                {
                    tmp = (uint16_t)(table[i + 1] & (USB_DIRFIELD | USB_EPNUMFIELD));
                    /* EP table endpoint dir check */
                    if( direp == tmp )
                    {
                        return table[i];
                    }
                }
            }
        }
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
    }
    return USB_ERROR;
}
/******************************************************************************
End of function usb_cstd_Epadr2Pipe
******************************************************************************/


/******************************************************************************
Function Name   : usb_cstd_Pipe2Epadr
Description     : Get the associated endpoint value of the specified pipe.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : uint8_t        : OK    : Endpoint nr + direction.
                :                : ERROR : Error.
******************************************************************************/
uint8_t usb_cstd_Pipe2Epadr(USB_UTR_t *ptr, uint16_t pipe)
{

    /* Check current function */
    if( usb_cstd_is_host_mode(ptr) == USB_NO )
    {
        /* Peripheral */
        USB_PRINTF0("Not support peripheral function\n");
        return (uint8_t)USB_ERROR;
    }
    else
    {
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
        uint16_t        buffer,direp;

