pwbf/RX64M_ETHERNET/r_usb_basic/src/driver/comm/r_usb_clibusbip.c
        /* Pipe select */
        usb_creg_write_pipesel( ptr, pipe );
        /* Read Pipe direction */
        buffer = usb_creg_read_pipecfg( ptr );
        direp = (uint16_t)((((buffer & USB_DIRFIELD) ^ USB_DIRFIELD) << 3) + (buffer & USB_EPNUMFIELD));
        return (uint8_t)(direp);
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
    }
    return (uint8_t)USB_ERROR;
}
/******************************************************************************
End of function usb_cstd_Pipe2Epadr
******************************************************************************/


/******************************************************************************
Function Name   : usb_cstd_Pipe2Fport
Description     : Get port No. from the specified pipe No. by argument
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : uint16_t       : FIFO port selector.
******************************************************************************/
uint16_t usb_cstd_Pipe2Fport(USB_UTR_t *ptr, uint16_t pipe)
{
    uint16_t        i, *table;

    /* Check current function */
    if( usb_cstd_is_host_mode(ptr) == USB_NO )
    {
#if USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP
        uint16_t    conf;

        conf = usb_gpstd_ConfigNum;
        if( conf < (uint16_t)1 )
        {
            /* Address state */
            conf = (uint16_t)1;
        }
        /* Peripheral */
        /* Get FIFO port from PIPE number */
        table = (uint16_t*)((uint16_t**)
            (usb_gpstd_Driver.pipetbl[conf - 1]));
        /* EP table loop */
        for( i = 0; table[i] != USB_PDTBLEND; i += USB_EPL )
        {
            if( table[i] == pipe )
            {
                return table[i + 5];
            }
        }
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP */
    }
    else
    {
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
        uint16_t        md;
        USB_HCDREG_t    *driver;

        /* Host */
        /* Get FIFO port from PIPE number */
        for( md = 0; md < usb_ghstd_DeviceNum[ptr->ip]; md++ )
        {
            if( (usb_ghstd_DeviceDrv[ptr->ip][md].ifclass != USB_IFCLS_NOT) &&
                (usb_ghstd_DeviceDrv[ptr->ip][md].devaddr != USB_NODEVICE) )
            {
                driver = (USB_HCDREG_t*)&usb_ghstd_DeviceDrv[ptr->ip][md];
                table = (uint16_t*)(driver->pipetbl);
                /* EP table loop */
                for( i = 0; table[i] != USB_PDTBLEND; i += USB_EPL )
                {
                    if( table[i] == pipe)
                    {
                        return table[i + 5];
                    }
                }
            }
        }
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
    }

    return USB_ERROR;
}
/******************************************************************************
End of function usb_cstd_Pipe2Fport
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_GetDeviceAddress
Description     : Get the device address associated with the specified pipe.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t pipe  : Pipe number.
Return value    : uint16_t DEVSEL-bit status
******************************************************************************/
uint16_t usb_cstd_GetDeviceAddress(USB_UTR_t *ptr, uint16_t pipe)
{
    uint16_t        buffer;

    /* Check current function */
    if( usb_cstd_is_host_mode(ptr) == USB_NO )
    {
#if USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP
        /* Peripheral */
        /* USB address */
        buffer = usb_creg_read_usbaddr( ptr );
        /* Device address */
        return (uint16_t)(buffer & USB_USBADDR_MASK);
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP */
    }
    else
    {
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
        uint16_t        i, md;
        USB_HCDREG_t    *driver;

        /* Host */
        if( pipe == USB_PIPE0 )
        {
            buffer = usb_creg_read_dcpmaxp( ptr );
            /* Device address */
            return (uint16_t)(buffer & USB_DEVSEL);
        }
        else
        {
            for( md = 0; md < usb_ghstd_DeviceNum[ptr->ip]; md++ )
            {
                if( (usb_ghstd_DeviceDrv[ptr->ip][md].ifclass != USB_IFCLS_NOT) &&
                    (usb_ghstd_DeviceDrv[ptr->ip][md].devaddr != USB_NODEVICE) )
                {
                    driver = (USB_HCDREG_t*)&usb_ghstd_DeviceDrv[ptr->ip][md];
                    /* EP table loop */
                    for( i = 0; driver->pipetbl[i] != USB_PDTBLEND; i
                        += USB_EPL )
                    {
                        if( driver->pipetbl[i] == pipe )
                        {
                            buffer = driver->pipetbl[i + 3];
                            /* Device address */
                            return (uint16_t)(buffer & USB_DEVSEL);
                        }
                    }
                }
            }
        }
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
    }
    return USB_ERROR;
}
/******************************************************************************
End of function usb_cstd_GetDeviceAddress
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_ClearIntEnb
Description     : Clear teh INTENB register.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
Return value    : none
******************************************************************************/
void    usb_cstd_ClearIntEnb( USB_UTR_t *ptr )
{
    usb_creg_write_intenb( ptr, 0 );
    /* Conditional compile dep. on difference of USB function */
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
    usb_hreg_write_intenb( ptr, USB_PORT0, 0 );
    usb_hreg_write_intenb( ptr, USB_PORT1, 0 );
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
}
/******************************************************************************
End of function usb_cstd_ClearIntEnb
******************************************************************************/

