pwbf/RX64M_ETHERNET/r_usb_basic/src/driver/comm/r_usb_clibusbip.c
/******************************************************************************
Function Name   : usb_cstd_ClearIntSts
Description     : Clear the INTSTS register.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
Return value    : none
******************************************************************************/
void    usb_cstd_ClearIntSts( USB_UTR_t *ptr )
{
    usb_creg_write_intsts( ptr, 0 );
/* Conditional compile dep. on difference of USB function */
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
    usb_hreg_write_intsts( ptr, USB_PORT0, 0 );
    usb_hreg_write_intsts( ptr, USB_PORT1, 0 );
#endif  /* USB_FUNCSEL_USBIP0_PP != USB_PERI_PP && USB_FUNCSEL_USBIP1_PP != USB_PERI_PP */
}
/******************************************************************************
End of function usb_cstd_ClearIntSts
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_ClearDline
Description     : Clear DRPD/DPRPU; host pulldown of resistors for D+ D- lines.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
Return value    : none
******************************************************************************/
void    usb_cstd_ClearDline( USB_UTR_t *ptr )
{
    usb_creg_clr_cnen( ptr );
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
    usb_hreg_clr_drpd( ptr, USB_PORT0 );
    usb_hreg_clr_drpd( ptr, USB_PORT1 );
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */

#if USB_FUNCSEL_USBIP0_PP == USB_PERI_PP || USB_FUNCSEL_USBIP1_PP == USB_PERI_PP
    usb_preg_clr_dprpu( ptr );
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
}
/******************************************************************************
End of function usb_cstd_ClearDline
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_PortSpeed
Description     : Get USB-speed of the specified port.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.
                : uint16_t port  : Root port
Return value    : uint16_t       : HSCONNECT : Hi-Speed
                :                : FSCONNECT : Full-Speed
                :                : LSCONNECT : Low-Speed
                :                : NOCONNECT : not connect
******************************************************************************/
uint16_t usb_cstd_PortSpeed(USB_UTR_t *ptr, uint16_t port)
{
    uint16_t    buf, ConnInf;

    buf = usb_creg_read_dvstctr( ptr, port );

    /* Reset handshake status get */
    buf = (uint16_t)(buf & USB_RHST);

    switch( buf )
    {
    /* Get port speed */
    case USB_HSMODE:    ConnInf = USB_HSCONNECT;    break;
    case USB_FSMODE:    ConnInf = USB_FSCONNECT;    break;
    case USB_LSMODE:    ConnInf = USB_LSCONNECT;    break;
    case USB_HSPROC:    ConnInf = USB_NOCONNECT;    break;
    default:        ConnInf = USB_NOCONNECT;    break;
    }

    return (ConnInf);
}
/******************************************************************************
End of function usb_cstd_PortSpeed
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_HiSpeedEnable
Description     : Check if set to Hi-speed.
Arguments       : USB_UTR_t *ptr : USB internal structure. Selects e.g. channel.    ;
                : uint16_t port  : Root port
Return value    : uint16_t       : YES; Hi-Speed enabled.
                :                : NO; Hi-Speed disabled.
******************************************************************************/
uint16_t usb_cstd_HiSpeedEnable(USB_UTR_t *ptr, uint16_t port)
{
    uint16_t    buf;

    buf = usb_creg_read_syscfg( ptr, port );

    if( (buf & USB_HSE) == USB_HSE )
    {
        /* Hi-Speed Enable */
        return USB_YES;
    }
    else
    {
        /* Hi-Speed Disable */
        return USB_NO;
    }
}
/******************************************************************************
End of function usb_cstd_HiSpeedEnable
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_SetHse
Description     : Set/clear the HSE-bit of the specified port.
Arguments       : uint16_t port     : Root port.
                : uint16_t speed    : HS_ENABLE/HS_DISABLE.
Return value    : none
******************************************************************************/
void usb_cstd_SetHse(USB_UTR_t *ptr, uint16_t port, uint16_t speed)
{
    if( speed == USB_HS_DISABLE )
    {
        /* HSE = disable */
        usb_creg_clr_hse( ptr, port );
    }
    else
    {
        /* HSE = enable */
        usb_creg_set_hse( ptr, port );
    }
}
/******************************************************************************
End of function usb_cstd_SetHse
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_DummyFunction
Description     : dummy function
Arguments       : uint16_t data1    : Not used.
                : uint16_t data2    : Not used.
Return value    : none
******************************************************************************/
void usb_cstd_DummyFunction(USB_UTR_t *ptr, uint16_t data1, uint16_t data2)
{
}
/******************************************************************************
End of function usb_cstd_DummyFunction
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_DummyTrn
Description     : dummy function
Arguments       : USB_REQUEST_t *data1  : Not used.
                : uint16_t data2        : Not used.
Return value    : none
******************************************************************************/
void usb_cstd_DummyTrn(USB_UTR_t *ptr, USB_REQUEST_t *data1, uint16_t data2)
{
}
/******************************************************************************
End of function usb_cstd_DummyTrn
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_set_usbip_mode
Description     : Set the Host mode or Peripheral mode to USB H/W
Arguments       : USB_UTR_t *ptr : USB system internal structure.
                : uint16_t function : Host mode/Peripheral mode
Return value    : none
******************************************************************************/
void usb_cstd_set_usbip_mode(USB_UTR_t *ptr, uint16_t function)
{
    /* USB interrupt message initialize */
    usb_cstd_InitUsbMessage(ptr, function);
    /* Select HW function */
    usb_cstd_set_usbip_mode_sub(ptr, function);
}/* eof usb_cstd_set_usbip_mode() */



/******************************************************************************
Function Name   : usb_cstd_set_sofcfg_intl
Description     : Set Interrupt sence mode(Level sence) for SOFCFG.
Arguments       : USB_UTR_t *ptr    : USB system internal structure.
Return value    : none
******************************************************************************/
void usb_cstd_set_sofcfg_intl( USB_UTR_t *ptr )
{
    usb_creg_set_sofcfg( ptr, USB_INTL );
} /* eof usb_cstd_set_sofcfg_intl() */



/******************************************************************************
End  Of File
******************************************************************************/
